


AND, OR и NOT

Оператори AND, OR, NOT використовуються як додатки до оператора WHERE для витягу конкретики даних:
AND - даний оператор прописується у випадку якщо необхідно відобразити більше 1 значення з різних таблиць або БД 
OR - даний оператор прописується у випадку якщо необхідно відобрачити всі значення true з різних таблиць або БД 
NOT - Відображає невідповідні значення false в базах даних.



SQL - IN

Оператор IN використовується для використання декількох значень в конструкціях WHERE


SQL - HAVING
Оператор HAVING використовується замість конструкції WHERE для використання аргументів функції.




SQL - EXISTS

Даний запис використовується для перевірки наявності будь-якого запису у вкладенному записі.